[
  {
    "image_name": "r1.jpg",
    "image_url": "https://example.com/images/r1.jpg",
    "short_description": "A modern gray sectional sofa with a wooden coffee table and side tables, set against a backdrop of dark curtains and a gray textured wall.",
    "detailed_description": "This is a cozy, modern living room featuring a large, L-shaped gray fabric sectional sofa. The sofa is decorated with accent pillows that have textured black-and-white patterns, adding visual interest. In front of it sits a contemporary coffee table with a wooden top and sleek wooden legs, which matches the smaller, tiered side tables. A shaggy gray rug anchors the seating area, while a trio of glass-like pendant lights hangs above. The room is styled with a potted green plant on one of the side tables and framed artwork on the wall, creating a stylish and inviting space.",
    "price": 1200,
    "discount_percentage": 15
  },
  {
    "image_name": "r2.jpg",
    "image_url": "https://example.com/images/r2.jpg",
    "short_description": "A minimalist living room with a white modular sofa, a glass coffee table, and a striking wood-paneled accent wall.",
    "detailed_description": "This image shows a serene, minimalist living space. The focal point is a low-profile, creamy white modular sofa with a soft, rounded shape, complemented by a light throw blanket. A unique glass-topped coffee table with a sculptural, cylindrical base sits in front of the sofa. The room’s most distinctive feature is the accent wall composed of vertical wooden slats, which adds warmth and texture. A sleek black track light system and a single, modern wall sconce provide lighting. To the left, a meticulously trimmed bonsai tree in a dark planter brings a touch of nature and artistry to the space.",
    "price": 2500,
    "discount_percentage": 0
  },
  {
    "image_name": "r3.jpg",
    "image_url": "https://example.com/images/r3.jpg",
    "short_description": "A bright living room with a large gray sectional sofa, a white coffee table, and a fluffy white rug.",
    "detailed_description": "This is an elegant and bright living room with a neutral color palette. It features a large, plush gray sectional sofa with an abundance of fluffy white and gray pillows, creating a comfortable and inviting feel. A simple, rectangular white coffee table with an open shelf design is placed centrally on a soft, high-pile gray rug. A smaller, faux fur rug is layered on top of the gray rug, adding a soft contrast. The room is well-lit by natural light from a large sliding glass door and features two large, framed monochromatic art pieces on the wall, enhancing the clean and modern aesthetic.",
    "price": 1800,
    "discount_percentage": 10
  },
  {
    "image_name": "n1.jpg",
    "image_url": "https://example.com/images/n1.jpg",
    "short_description": "A luxurious, earth-toned bedroom with a low-profile bed, an accent wall with a rough texture, and ambient lighting.",
    "detailed_description": "This bedroom exudes a calm and sophisticated ambiance with its neutral, earthy tones. The centerpiece is a low, upholstered bed with a large headboard. The bed is covered in layered duvets and pillows in shades of brown, gray, and beige. The wall behind the bed has a striking, textured concrete-like finish, while a section of vertical wooden slats adds a contrasting element. Hidden LED strip lighting illuminates the headboard area, creating a soft, warm glow. The room also features a unique hanging pendant light, a small side table, and modern artwork resting on the floor, all contributing to a sleek and tranquil design.",
    "price": 3000,
    "discount_percentage": 0
  },
  {
    "image_name": "n2.jpg",
    "image_url": "https://example.com/images/n2.jpg",
    "short_description": "A moody and dark bedroom with a black bed, a textured accent wall, and dramatic, warm lighting.",
    "detailed_description": "This is a dramatic and modern bedroom with a dark, moody aesthetic. The room features a large, low-profile black upholstered bed with a dark, textured headboard. The bedding is a mix of rich dark gray and black fabrics. The most prominent feature is the dark, marble-like accent wall behind the bed, which is beautifully highlighted by a continuous strip of hidden warm LED lighting. The floor is a warm-toned wood, providing a nice contrast to the dark furniture and walls. Minimalist hanging pendant lights on either side of the bed and a plush gray rug complete the space, giving it a luxurious and intimate feel.",
    "price": 2800,
    "discount_percentage": 10
  },
  {
    "image_name": "c1.jpg",
    "image_url": "https://example.com/images/c1.jpg",
    "short_description": "A foldable black chair with two different positions shown: leaning back and lying flat.",
    "detailed_description": "This image displays a multi-functional black folding chair designed for relaxation. The product is shown in two configurations: on the left, it is in a 'Leaning status', resembling a comfortable lounger with a raised back and an attached headrest. On the right, it is shown in a 'Lying flat' position, demonstrating its ability to extend into a full-length cot or bed. The chair features a padded, quilted surface for comfort and a sturdy metal frame, making it suitable for both indoor and outdoor use. The image highlights the chair's versatility and practicality.",
    "price": 150,
    "discount_percentage": 5
  },
  {
    "image_name": "c2.jpg",
    "image_url": "https://example.com/images/c2.jpg",
    "short_description": "A simple gray bean bag chair in a sunny room with a large window.",
    "detailed_description": "This photo shows a comfortable and casual living space featuring a large, light gray bean bag chair. The chair has a simple, minimalist design with a handle on the top for easy movement. It's placed on a soft gray rug near a large window, which is covered with white blinds. A side table with a few decorative items is visible next to the bean bag. The natural light streaming in through the window and the simple design of the chair give the room a relaxed and inviting atmosphere.",
    "price": 90,
    "discount_percentage": 0
  }
]